# İstanbul'daki 15 Tarihi Mekan ve Koordinatları (Senaryo 6)
LOCATIONS = {
    "Ayasofya": {"lat": 41.00866596323161, "lon": 28.980203277535413},
    "Topkapı Sarayı": {"lat": 41.011546775027156, "lon": 28.98337453000274},
    "Sultanahmet Camii": {"lat": 41.00549455340017, "lon": 28.97679445211606},
    "Yerebatan Sarnıcı": {"lat": 41.00840627650313, "lon": 28.97786905582294},
    "Kapalıçarşı": {"lat": 41.01073488536414, "lon": 28.968074503854375},
    "Mısır Çarşısı": {"lat": 41.016558655970755, "lon": 28.970512153861797},
    "Galata Kulesi": {"lat": 41.02560523107294, "lon": 28.97413366755914},
    "Dolmabahçe Sarayı": {"lat": 41.03923684515276, "lon": 29.00045693626448},
    "Kız Kulesi": {"lat": 41.02126467056856, "lon": 29.004106733694552},
    "Süleymaniye Camii": {"lat": 41.01615352457848, "lon": 28.963999294254887},
    "İstanbul Arkeoloji Müzesi": {"lat": 41.01175510321344, "lon": 28.98130734346328},
    "Kariye Müzesi": {"lat": 41.03013601465909, "lon": 28.94959833818985},
    "Pierre Loti Tepesi": {"lat": 41.05441339314499, "lon": 28.933379488145142},
    "Rumeli Hisarı": {"lat": 41.0848991213092, "lon": 29.056703245627226},
    "Miniatürk": {"lat": 41.05905569694838, "lon": 28.949202242904953}
}